src/Catalogs/FL_Handlers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>FL_Handlers</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FormatFileExtension</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormatFullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormatMediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>76</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormatShortName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormatStandard</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormatStandardLink</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HandlerType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FL_HandlerTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegisteredHandlerName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/FL_Handlers/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// This file is part of FoxyLink.
// Copyright © 2016-2020 Petro Bazeliuk.
// 
// This program is free software: you can redistribute it and/or modify 
// it under the terms of the GNU Affero General Public License as 
// published by the Free Software Foundation, either version 3 of the License,
// or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful, 
// but WITHOUT ANY WARRANTY; without even the implied warranty of 
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License 
// along with FoxyLink. If not, see <http://www.gnu.org/licenses/agpl-3.0>.
//
////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
    
#Region ProgramInterface 

// This function returns a registered handler for the content-type.
//
// Parameters:
//  ContentType - String - content media type.
//
// Returns:
//  Undefined - format data processor not found.
//  DataProcessorObject.<Data processor name> - format data processor.
//  ExternalDataProcessorObject.<Data processor name> - external format data processor.
//
Function NewRegisteredHandlerForContentType(ContentType) Export
    
    Query = New Query;
    Query.Text = QueryTextRegisteredHandlerForContentType();
    Query.SetParameter("ContentType", ContentType);    
    Return NewDataProcessor(Query);
    
EndFunction // NewRegisteredHandlerForContentType()

// This function returns a registered handler for the file extension.
//
// Parameters:
//  FileExtension - String - file extension of media type.
//
// Returns:
//  Undefined - format data processor not found.
//  DataProcessorObject.<Data processor name> - format data processor.
//  ExternalDataProcessorObject.<Data processor name> - external format data processor.
//
Function NewRegisteredHandlerForFileExtension(FileExtension) Export
    
    Query = New Query;
    Query.Text = QueryTextRegisteredHandlerForFileExtension();
    Query.SetParameter("FileExtension", FileExtension);
    Return NewDataProcessor(Query);
    
EndFunction // NewRegisteredHandlerForFileExtension()

#EndRegion // ProgramInterface

#Region ServiceProceduresAndFunctions

// Only for internal use.
//
Function NewDataProcessor(Query)
    
    QueryResult = Query.Execute();
    If QueryResult.IsEmpty() Then
        Return Undefined;
    EndIf;
    
    QueryResultSelection = QueryResult.Select();
    QueryResultSelection.Next();
    HandlerName = QueryResultSelection.RegisteredHandlerName;   
    Return DataProcessors[HandlerName].Create();
    
EndFunction // NewDataProcessor()

// Only for internal use.
// 
Function QueryTextRegisteredHandlerForContentType()
    
    Return "
        |SELECT
        |   Handlers.Ref AS Ref,
        |   Handlers.RegisteredHandlerName AS RegisteredHandlerName 
        |FROM
        |   Catalog.FL_Handlers AS Handlers
        |WHERE
        |   Handlers.DeletionMark = False
        |AND Handlers.FormatMediaType = &ContentType
        |";
    
EndFunction // QueryTextRegisteredHandlerForContentType()

// Only for internal use.
// 
Function QueryTextRegisteredHandlerForFileExtension()
    
    Return "
        |SELECT
        |   Handlers.Ref AS Ref,
        |   Handlers.RegisteredHandlerName AS RegisteredHandlerName 
        |FROM
        |   Catalog.FL_Handlers AS Handlers
        |WHERE
        |   Handlers.DeletionMark = False
        |AND Handlers.FormatFileExtension = &FileExtension
        |";
    
EndFunction // QueryTextRegisteredHandlerForFileExtension()

#EndRegion // ServiceProceduresAndFunctions 

#EndIf
